Revit 2025 API
RailTransitionOption Enumeration
 The transition type of the continuous rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RailTransitionOption
Public Enumeration RailTransitionOption
public enum class RailTransitionOption
type RailTransitionOption
Members
Member name | Value | Description
None | 0 |  No transition.
Gooseneck | 1 |  Gooseneck.
Simple | 2 |  Simple
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace